Use KHAT_MyBase

--ex1,2--

select ÐÀÑÕÎÄÛ.[Íîìåð ÷åêà], ÐÀÑÕÎÄÛ.[Ïîòðà÷åííàÿ ñóììà], ÒÎÂÀÐÛ.[Íàçâàíèå òîâàðà]
	from ÐÀÑÕÎÄÛ inner join ÒÎÂÀÐÛ on ÒÎÂÀÐÛ.[Íàçâàíèå òîâàðà] = ÐÀÑÕÎÄÛ.Òîâàð;

	select ÐÀÑÕÎÄÛ.[Íîìåð ÷åêà], ÐÀÑÕÎÄÛ.[Ïîòðà÷åííàÿ ñóììà], ÒÎÂÀÐÛ.[Íàçâàíèå òîâàðà]
	from ÐÀÑÕÎÄÛ inner join ÒÎÂÀÐÛ on ÒÎÂÀÐÛ.[Íàçâàíèå òîâàðà] = ÐÀÑÕÎÄÛ.Òîâàð and ÒÎÂÀÐÛ.[Íàçâàíèå òîâàðà] like '%î%';

--ex3---

select ÐÀÑÕÎÄÛ.[Íîìåð ÷åêà] as Íîìåð, ÎÒÄÅËÛ.[Íàçâàíèå îòäåëà] as Îòäåë, ÒÎÂÀÐÛ.[Íàçâàíèå òîâàðà] as Òîâàð,
case
when ÐÀÑÕÎÄÛ.Äàòà = '2023-09-22' then '22 ñåíòÿáðÿ'
when ÐÀÑÕÎÄÛ.Äàòà = '2023-09-23' then '23 ñåíòÿáðÿ'
else 'äðóãàÿ äàòà'
end as Äàòà
	from ÐÀÑÕÎÄÛ inner join ÎÒÄÅËÛ on ÎÒÄÅËÛ.[Íàçâàíèå îòäåëà] = ÐÀÑÕÎÄÛ.Îòäåë
	inner join ÒÎÂÀÐÛ on ÒÎÂÀÐÛ.[Íàçâàíèå òîâàðà] = ÐÀÑÕÎÄÛ.Òîâàð;

--ex4--

SELECT [Íàçâàíèå îòäåëà] AS Îòäåë, ISNULL(ÐÀÑÕÎÄÛ.Òîâàð, '***') as Òîâàð, ISNULL(ÐÀÑÕÎÄÛ.Êîëè÷åñòâî, 0) as Êîëüâî, 
ISNULL(ÐÀÑÕÎÄÛ.[Ïîòðà÷åííàÿ ñóììà], 0) as Ñóììà, ISNULL(ÎÒÄÅËÛ.[Ïðåäåëüíàÿ íîðìà ðàñõîäà], 0) as [Íîðìà ðàñõîäà]
from ÎÒÄÅËÛ left outer join ÐÀÑÕÎÄÛ on ÎÒÄÅËÛ.[Íàçâàíèå îòäåëà] = ÐÀÑÕÎÄÛ.Îòäåë;

--ex5---

SELECT ISNULL(ÐÀÑÕÎÄÛ.Òîâàð, '***') AS Òîâàð, ÐÀÑÕÎÄÛ.Äàòà AS Äàòà, ISNULL(ÐÀÑÕÎÄÛ.[Ïîòðà÷åííàÿ ñóììà], 0) as Ïîòðà÷åíî, ÒÎÂÀÐÛ.Öåíà as Öåíà_òîâàðà, ÒÎÂÀÐÛ.Îïèñàíèå as Îïèñàíèå
from ÒÎÂÀÐÛ left outer join ÐÀÑÕÎÄÛ
on ÒÎÂÀÐÛ.[Íàçâàíèå òîâàðà] = ÐÀÑÕÎÄÛ.Òîâàð

SELECT ISNULL(ÐÀÑÕÎÄÛ.Òîâàð, '***') AS Òîâàð, ÐÀÑÕÎÄÛ.Äàòà AS Äàòà, ISNULL(ÐÀÑÕÎÄÛ.[Ïîòðà÷åííàÿ ñóììà], 0) as Ïîòðà÷åíî, ÒÎÂÀÐÛ.Öåíà as Öåíà_òîâàðà, ÒÎÂÀÐÛ.Îïèñàíèå as Îïèñàíèå
from ÒÎÂÀÐÛ right outer join ÐÀÑÕÎÄÛ
on ÒÎÂÀÐÛ.[Íàçâàíèå òîâàðà] = ÐÀÑÕÎÄÛ.Òîâàð

SELECT ISNULL(ÐÀÑÕÎÄÛ.Òîâàð, '***') AS Òîâàð, ÐÀÑÕÎÄÛ.Äàòà AS Äàòà, ISNULL(ÐÀÑÕÎÄÛ.[Ïîòðà÷åííàÿ ñóììà], 0) as Ïîòðà÷åíî, ÒÎÂÀÐÛ.Öåíà as Öåíà_òîâàðà, ÒÎÂÀÐÛ.Îïèñàíèå as Îïèñàíèå
from ÒÎÂÀÐÛ full outer join ÐÀÑÕÎÄÛ
on ÒÎÂÀÐÛ.[Íàçâàíèå òîâàðà] = ÐÀÑÕÎÄÛ.Òîâàð

select count(*)
from ÒÎÂÀÐÛ left outer join ÐÀÑÕÎÄÛ
on ÒÎÂÀÐÛ.[Íàçâàíèå òîâàðà] = ÐÀÑÕÎÄÛ.Òîâàð

select count(*)
from ÒÎÂÀÐÛ right outer join ÐÀÑÕÎÄÛ
on ÒÎÂÀÐÛ.[Íàçâàíèå òîâàðà] = ÐÀÑÕÎÄÛ.Òîâàð

select count(*)
from ÒÎÂÀÐÛ full outer join ÐÀÑÕÎÄÛ
on ÒÎÂÀÐÛ.[Íàçâàíèå òîâàðà] = ÐÀÑÕÎÄÛ.Òîâàð

--ex6----

select ÒÎÂÀÐÛ.[Íàçâàíèå òîâàðà] as Òîâàð, ÐÀÑÕÎÄÛ.Äàòà, ÐÀÑÕÎÄÛ.Êîëè÷åñòâî, ÐÀÑÕÎÄÛ.[Ïîòðà÷åííàÿ ñóììà], ÒÎÂÀÐÛ.Îïèñàíèå 
from ÒÎÂÀÐÛ cross join ÐÀÑÕÎÄÛ
where ÐÀÑÕÎÄÛ.Êîëè÷åñòâî >= 10;