use KHAT_MyBase;

--ex1--
select РАСХОДЫ.Товар, РАСХОДЫ.Дата,
ТОВАРЫ.Цена
From РАСХОДЫ, ТОВАРЫ
where ТОВАРЫ.[Название товара] = РАСХОДЫ.Товар
		and
		Отдел in (select [Название отдела] from ОТДЕЛЫ
										where (Отдел like 'Разраб%'));

--ex2--
select РАСХОДЫ.Товар, РАСХОДЫ.Дата,
ТОВАРЫ.Цена
From РАСХОДЫ inner join ТОВАРЫ
on ТОВАРЫ.[Название товара] = РАСХОДЫ.Товар
		and
		Отдел in (select [Название отдела] from ОТДЕЛЫ
										where (Отдел like 'Разраб%'));

--ex3--
select РАСХОДЫ.Товар, РАСХОДЫ.Дата,
ТОВАРЫ.Цена
From РАСХОДЫ inner join ТОВАРЫ
on ТОВАРЫ.[Название товара] = РАСХОДЫ.Товар
		inner join ОТДЕЛЫ
		on ОТДЕЛЫ.[Название отдела] = РАСХОДЫ.Отдел
		where (Отдел like 'Разраб%');
		

--ex4--

select Р.Товар, Р.[Потраченная сумма]
from РАСХОДЫ Р
where Р.[Потраченная сумма] = (select top(1) Р2.[Потраченная сумма] from РАСХОДЫ Р2
    where Р2.Товар = Р.Товар
	order by [Потраченная сумма] desc);

--ex5--
select * from ТОВАРЫ
	where exists (select * from РАСХОДЫ
		where РАСХОДЫ.Товар = ТОВАРЫ.[Название товара])

--ex6--
select top 1
	(select avg([Потраченная сумма]) from Расходы
		where Товар like 'Клавиатура')[Клава],
	(select avg([Потраченная сумма]) from Расходы
		where Товар like 'Стол')[Стол]
from РАСХОДЫ

--ex7--

select [Название товара], Цена from ТОВАРЫ
	where Цена > all (select Цена from ТОВАРЫ
					where [Название товара] like 'О%')

--ex8--

select [Название товара], Цена from ТОВАРЫ
	where Цена > any (select Цена from ТОВАРЫ
					where [Название товара] like 'О%')