use KHAT_MyBase;

--ex1,2----

select Товар,
MAX([Потраченная сумма])[Максимально потрачено],
MIN([Потраченная сумма])[Минимально потрачено],
AVG([Потраченная сумма])[Потрачено в средем],
SUM([Потраченная сумма])[Потрачено в сумме],
COUNT([Потраченная сумма])[Количество чеков]
from Расходы inner join ТОВАРЫ
on РАСХОДЫ.Товар = ТОВАРЫ.[Название товара]
group by Товар;


--ex3----

	select * from
		(select case
			when Цена > 700 and Цена < 2000 then '700 < цена < 2000'
			when Цена < 700 then 'цена < 700'	
			else 'цена > 2000'
			end [Пределы цен], count(*) Количество
		from ТОВАРЫ group by case
			when Цена > 700 and Цена < 2000 then '700 < цена < 2000'
			when Цена < 700 then 'цена < 700'
			else 'цена > 2000'
			end) as a
		order by case[Пределы цен]
			when 'цена < 700' then 3
			when '700 < цена < 2000' then 2
			when 'цена > 2000' then 1
			else 0 
			end;

---ex4---

select t.[Название товара],
		t.Цена,
		o.[Название отдела],
		round(avg(cast(r.[Потраченная сумма] as float(4))),2) [Потраченная сумма]
		from Товары t inner join РАСХОДЫ r
		on t.[Название товара] = r.Товар
		inner join ОТДЕЛЫ o
		on o.[Название отдела] = r.Отдел
		group by t.[Название товара],
		t.Цена,
		o.[Название отдела]


--ex5--
select t.[Название товара],
	t.Цена,
	o.[Название отдела],
	round(avg(cast(r.[Потраченная сумма] as float(4))),2) [Потраченная сумма]
	from Товары t inner join РАСХОДЫ r
	on t.[Название товара] = r.Товар
	inner join ОТДЕЛЫ o
	on o.[Название отдела] = r.Отдел
	where t.[Название товара] = 'Клавиатура'
	group by t.[Название товара],
	t.Цена,
	o.[Название отдела]

--ex6--

select Товар, Sum([Потраченная сумма]) [Потраченная сумма], SUM(Количество)
	Количество
	from РАСХОДЫ
	where Товар in ('Клавиатура', 'Стол')
	Group by Товар

--ex7--

select distinct r1.Товар,
	(select count(*) from РАСХОДЫ r2
	where r1.Товар = r2.Товар ) [Количество сумм > 2000]
	from РАСХОДЫ r1
	group by r1.Товар, r1.[Потраченная сумма]
	having [Потраченная сумма] > 2000