use KHAT_MyBase;

--ex1--
SELECT ISNULL(РАСХОДЫ.Товар, 'Все') as Товар, ТОВАРЫ.Цена, SUM(РАСХОДЫ.Количество) as [Количество], SUM(РАСХОДЫ.[Потраченная сумма]) as [Потрачено]
from РАСХОДЫ inner join ТОВАРЫ
on РАСХОДЫ.Товар = ТОВАРЫ.[Название товара]
WHERE Товар in ('Клавиатура', 'Стол')
GROUP BY ROLLUP (Товар, Цена);



--ex2--
SELECT ISNULL(РАСХОДЫ.Товар, 'Все') as Товар, ТОВАРЫ.Цена, SUM(РАСХОДЫ.Количество) as [Количество], SUM(РАСХОДЫ.[Потраченная сумма]) as [Потрачено]
from РАСХОДЫ inner join ТОВАРЫ
on РАСХОДЫ.Товар = ТОВАРЫ.[Название товара]
WHERE Товар in ('Клавиатура', 'Стол')
GROUP BY CUBE (Товар, Цена);


--ex3--

select Товар, SUM(Количество)[Количество], SUM([Потраченная сумма])[Потрачено]
from РАСХОДЫ
where Отдел in ('Аналитика данных', 'Разработка')
group by Товар


select Товар, SUM(Количество)[Количество], SUM([Потраченная сумма])[Потрачено]
from РАСХОДЫ
where Отдел = 'Разработка'
group by Товар


select Товар, SUM(Количество)[Количество], SUM([Потраченная сумма])[Потрачено]
from РАСХОДЫ
where Отдел in ('Аналитика данных', 'Разработка')
group by Товар
UNION
select Товар, SUM(Количество)[Количество], SUM([Потраченная сумма])[Потрачено]
from РАСХОДЫ
where Отдел = 'Разработка'
group by Товар

select Товар, SUM(Количество)[Количество], SUM([Потраченная сумма])[Потрачено]
from РАСХОДЫ
where Отдел in ('Аналитика данных', 'Разработка')
group by Товар
UNION ALL
select Товар, SUM(Количество)[Количество], SUM([Потраченная сумма])[Потрачено]
from РАСХОДЫ
where Отдел = 'Разработка'
group by Товар

--ex4--
select Товар, SUM(Количество)[Количество], SUM([Потраченная сумма])[Потрачено]
from РАСХОДЫ
where Отдел in ('Аналитика данных', 'Разработка')
group by Товар
INTERSECT
select Товар, SUM(Количество)[Количество], SUM([Потраченная сумма])[Потрачено]
from РАСХОДЫ
where Отдел = 'Разработка'
group by Товар

--ex5

select Товар, SUM(Количество)[Количество], SUM([Потраченная сумма])[Потрачено]
from РАСХОДЫ
where Отдел in ('Аналитика данных', 'Разработка')
group by Товар
EXCEPT
select Товар, SUM(Количество)[Количество], SUM([Потраченная сумма])[Потрачено]
from РАСХОДЫ
where Отдел = 'Разработка'
group by Товар